13/data/attachments/7a40dd355a1f254c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Tyrone_boy_Actions_60448_4</nif:username>
            <nif:friendToBeRequested>soap_actions_9c584c2b-d000-4a7d-b582-82a24adaa521</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>