12/data/attachments/32651bf28d10e8de.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_e0c2076e-fcdb-4adb-90d6-774eb205e300</nif:username>
            <nif:friendToBeAdded>Christy_almost_Actions_5379_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>