10/data/attachments/c05f06c497b2f968.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:friendsPageRequest>
            <nif:username>soap_friends_cd72e90a-4f6b-4d2f-8072-71fdbca03d0f</nif:username>
            <nif:pageInfo>
                <nif:page>-1</nif:page>
                <nif:size>-1</nif:size>
                
            </nif:pageInfo>
            
        </nif:friendsPageRequest>
    </soapenv:Body>
</soapenv:Envelope>