13/data/attachments/e5767a03c165aa9b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:allUsersPageRequest>
            <nif:username>soap_user_303dc583-456c-44e3-ba75-e87141f6ac55</nif:username>
            <nif:pageInfo>
                <nif:page>4</nif:page>
                <nif:size>100</nif:size>
                
            </nif:pageInfo>
            
        </nif:allUsersPageRequest>
    </soapenv:Body>
</soapenv:Envelope>