11/data/attachments/5ebcefc81b811068.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:removeFriendRequest>
            <nif:username>soap_actions_b88ac888-308b-45fe-b038-8dfbff7478d6</nif:username>
            <nif:friendToBeRemoved>Steven_worker_Actions_35472_0</nif:friendToBeRemoved>
        </nif:removeFriendRequest>
    </soapenv:Body>
</soapenv:Envelope>