12/data/attachments/d8a09f0ae9bbdd74.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:currentUserRequest>
            <nif:username>soap_user_26866119-e4e4-4b5c-86e9-f0c1bec6de04</nif:username>
        </nif:currentUserRequest>
    </soapenv:Body>
</soapenv:Envelope>