13/data/attachments/69280e2aab3627c4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:allUsersRequest>
            <nif:username>soap_user_9051ac7f-06a5-4b5e-bf71-4d82c0d09775</nif:username>
            
        </nif:allUsersRequest>
    </soapenv:Body>
</soapenv:Envelope>