12/data/attachments/b499b113056af807.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_48adb2db-3479-4823-9113-456fc39ab800</nif:username>
            <nif:friendToBeAdded>Jon_until_Actions_68162_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>