12/data/attachments/e2b9669b44331469.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:allUsersPageRequest>
            <nif:username>soap_user_dfe160ff-837d-42db-889f-cb22f9c25c88</nif:username>
            <nif:pageInfo>
                <nif:page>1</nif:page>
                <nif:size>0</nif:size>
                
            </nif:pageInfo>
            
        </nif:allUsersPageRequest>
    </soapenv:Body>
</soapenv:Envelope>