13/data/attachments/2a275d355ccac36a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:currentUserRequest>
            <nif:username>soap_user_a4764ea5-5213-4a49-84af-3a817c032d35</nif:username>
        </nif:currentUserRequest>
    </soapenv:Body>
</soapenv:Envelope>