9/data/attachments/fe18499bcf321afa.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:removeFriendRequest>
            <nif:username>soap_actions_b775d349-2eeb-4305-a8b7-27b2b2fa0725</nif:username>
            <nif:friendToBeRemoved>Aaron_now_Actions_49648_0</nif:friendToBeRemoved>
        </nif:removeFriendRequest>
    </soapenv:Body>
</soapenv:Envelope>