10/data/attachments/29aa0c3582f8745e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:updateUserRequest>
            <nif:user>
                <nif:id>45d65f32-ead0-4b92-84c0-021a97a61a08</nif:id>
                <nif:username>soap_user_b54dff8a-22ff-453f-8181-9f6f750d6bfa</nif:username>
                <nif:currency>KZT</nif:currency>
                
                
                
                
                &lt;nif:fullName&gt;{ Michael Peters }&lt;/nif:fullName&gt;
                
            </nif:user>
        </nif:updateUserRequest>
    </soapenv:Body>
</soapenv:Envelope>