13/data/attachments/b74d5bdd935ac5a5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:declineInvitationRequest>
            <nif:username>Erica_because_Actions_48045_7</nif:username>
            <nif:invitationToBeDeclined>soap_actions_5e574897-88e7-4f14-9482-898188db5716</nif:invitationToBeDeclined>
        </nif:declineInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>