niffler-python-tests/schemas/templates/xml/all_users.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:allUsersRequest>
            <nif:username>{{ username }}</nif:username>
            {{ search_part }}
        </nif:allUsersRequest>
    </soapenv:Body>
</soapenv:Envelope>