11/data/attachments/8e561cf50ae963aa.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Jesus_professional_Friend_68944_5</nif:username>
            <nif:friendToBeRequested>soap_friends_2fb8ea95-c8c2-4314-b1df-62c33b5d3430</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>