10/data/attachments/5e3ab2bbfaaba75.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_7a7d4e4f-fd83-4257-a088-faddf684ca2d</nif:username>
            <nif:friendToBeAdded>Vanessa_customer_Friend_26575_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>