12/data/attachments/4e10941d4d0e6ce5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:friendsPageRequest>
            <nif:username>soap_friends_d1312f10-2f27-468c-a685-2afde87b5468</nif:username>
            <nif:pageInfo>
                <nif:page>4</nif:page>
                <nif:size>100</nif:size>
                
            </nif:pageInfo>
            
        </nif:friendsPageRequest>
    </soapenv:Body>
</soapenv:Envelope>