10/data/attachments/387906db27130cef.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:allUsersPageRequest>
            <nif:username>soap_user_09756eeb-0997-4f5c-a3c1-78788890ac58</nif:username>
            <nif:pageInfo>
                <nif:page>1</nif:page>
                <nif:size>3</nif:size>
                
            </nif:pageInfo>
            
        </nif:allUsersPageRequest>
    </soapenv:Body>
</soapenv:Envelope>