12/data/attachments/4706059c8a46a157.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:friendsRequest>
            <nif:username>soap_friends_d576d136-7db5-41f1-bde4-2b4e07f990f4</nif:username>
            
        </nif:friendsRequest>
    </soapenv:Body>
</soapenv:Envelope>