9/data/attachments/c1d0f88b3d18f85e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:updateUserRequest>
            <nif:user>
                <nif:id>9a9798fb-6209-4fa5-a4af-1bc68a2bdaad</nif:id>
                <nif:username>soap_user_4543ce50-fe37-45a7-a97e-7a61b2fd290a</nif:username>
                <nif:currency>USD</nif:currency>
                
                
                
                
                &lt;nif:fullName&gt;{ Rachel King }&lt;/nif:fullName&gt;
                
            </nif:user>
        </nif:updateUserRequest>
    </soapenv:Body>
</soapenv:Envelope>