11/data/attachments/b99a97536140aa1c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:declineInvitationRequest>
            <nif:username>Julie_information_Actions_15932_7</nif:username>
            <nif:invitationToBeDeclined>soap_actions_830c1803-fff4-4d56-a911-8214dfd00b06</nif:invitationToBeDeclined>
        </nif:declineInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>