12/data/attachments/a6bfcec9c1620220.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:allUsersRequest>
            <nif:username>soap_user_d40769a1-af77-45d4-970d-46c390f6ab62</nif:username>
            
        </nif:allUsersRequest>
    </soapenv:Body>
</soapenv:Envelope>