python_test/resources/templates/xml/current_user.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:currentUserRequest>
            <nif:username>{{ username }}</nif:username>
        </nif:currentUserRequest>
    </soapenv:Body>
</soapenv:Envelope>